"""
GIT - Распределенная система контроля версии.
Это система для отслеживания и ведения истории изменения файлом, в вашем проекте.
Репозиторий - хранилище вашего кода и истории его изменений.

GITHub - веб сайт для размещения git-репозиториев и совместной разработки проектов.

"""

'''
                                        Команды Git
# 1. git init - она создает новый гит репозиторий локально на вашем пк (пишется только 1 раз)

# 2. git commit - как только мы достигаем определенного момента в разработке, 
то тогда мы сохраняем и комментируем изменения.(фиксация изменений в репозитории)
# git commit -m '<comment>' 

# 3. git add - когда мы создаем или изменяем файлы, 
то при помощи этой команды мы загружаем все изменения в локальное хранилище
# git add <название файла>

# git add .

# 4. git remote add - это команда для того чтобы связать ваш проект с удаленным репозиторием(репозит в гитхаб)

# git remote add <название подключения> <ссылка на репозиторий> (только 1 раз пишется)
# git remote add origin <url>

# 5. git push - После коммита изменений при помощи этой команды 
мы отправляем наши изменения на удаленный репозиторий

# git push origin <название ветки>
'''
# =============================================================================================================

'''
# 6. git branch - ветки очень важны в git. 
При помощи веток, несколько программистов могум работать паралельно на одном и том же проекте.
При помощи git branch мы можем создавать, просматривать или удалять ветки.

# Создание ветки: git branch <название ветки>
# Просмотр ветки: git branch or git branch --list
# Удаление ветки: git branch -d <название ветки>


# 7 git checkout - команда используется для работы в группе(teamwork), 
она помогает переключаться по веткам. 

# git checkout <название ветки>



Строчка ветки(ayio)

'''