"""
GIT - Распределенная система контроля версии.
Это система для отслеживания и ведения истории изменения файлом, в вашем проекте.
Репозиторий - хранилище вашего кода и истории его изменений.

GITHub - веб сайт для размещения git-репозиториев и совместной разработки проектов.

"""

'''
                                        Команды Git
# 1. git init - она создает новый гит репозиторий локально на вашем пк

# 2. git commit - как только мы достигаем определенного момента в разработке, 
то тогда мы сохраняем и комментируем изменения.(фиксация изменений в репозитории)
# git commit -m '<comment>' 

# 3. git add - когда мы создаем или изменяем файлы, 
то при помощи этой команды мы загружаем все изменения в локальное хранилище
# git add <название файла>

# git add .
'''


