CTRL+ALT+T - команда открытия терминала (B спотлайт вводим Terminal)

"~" - символ домашней директории (папки)
"/" - символ корневой директории (папки)

cd .. -> "назад" обозначает предыдущую директорию
cd . -> обозначает текущую директорию

1. ls(list) - выводит список всех директорий (папок) и файлов в текузей рабочей директории

2. cd(change directory) -> меняет текущую  директорию(папку) на указанную
(cd <название директории>)

3. touch -> создает указанный файл (touch <name_of_file>)

4. mkdir(make directory) -> создает директорию (mkdir <name_of_file>)

5. rmdir(remove directory) -> удаляет директорию (rmdir <name_of_file>)

6. pwd (present working directory) ->  выводит путь до текущей директории (папки)

7. rm -rf -> принудительное удаление

8. rm -> удаление файла

9. ls -a -> выводит список как скрытых так и обычных директорий и файлов

10. nano <path_to_file> or <name_of_file> -> открывает графический интерфейс для редактирования файла
*если нет указанного файла, то создается новый файл с таким именем

11. cat <path_to_file> выводит содержимое файла
 
